Show / Hide Table of Contents
Class Material
Material base class
Inheritance
System.Object
OpenObject
OpenElementId
Material
MatConcrete
MaterialBoltGrade
MatPrestressSteel
MatReinforcement
MatSteel
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class Material : OpenElementId
Properties
Improve this Doc   View Source
E
Young's modulus
Declaration
public double E { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
G
Shear modulus
Declaration
public double G { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
IsDefaultMaterial
True if material is default material from the code
Declaration
public bool IsDefaultMaterial { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
LoadFromLibrary
Load from library - try override properties from library find material by name
Declaration
public bool LoadFromLibrary { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Name
Name of material
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
OrderInCode
Order of this material in the code
Declaration
public int OrderInCode { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Poisson
Poisson's ratio
Declaration
public double Poisson { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
SpecificHeat
Specific heat capacity
Declaration
public double SpecificHeat { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
StateOfThermalConductivity
State of thermal conductivity curvature
Declaration
public ThermalConductivityState StateOfThermalConductivity { get; set; }
Property Value
 Type |  Description
 ThermalConductivityState
Improve this Doc   View Source
StateOfThermalExpansion
State of thermal expansion curvature
Declaration
public ThermalExpansionState StateOfThermalExpansion { get; set; }
Property Value
 Type |  Description
 ThermalExpansionState
Improve this Doc   View Source
StateOfThermalSpecificHeat
State of thermal specific heat curvature
Declaration
public ThermalSpecificHeatState StateOfThermalSpecificHeat { get; set; }
Property Value
 Type |  Description
 ThermalSpecificHeatState
Improve this Doc   View Source
StateOfThermalStrain
State of thermal strain curvature
Declaration
public ThermalStrainState StateOfThermalStrain { get; set; }
Property Value
 Type |  Description
 ThermalStrainState
Improve this Doc   View Source
StateOfThermalStressStrain
State of thermal specific stress-strain curvature
Declaration
public ThermalStressStrainState StateOfThermalStressStrain { get; set; }
Property Value
 Type |  Description
 ThermalStressStrainState
Improve this Doc   View Source
ThermalConductivity
Thermal conductivity
Declaration
public double ThermalConductivity { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ThermalExpansion
Thermal expansion
Declaration
public double ThermalExpansion { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
UnitMass
Unit weight
Declaration
public double UnitMass { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
UserThermalConductivityCurvature
User-defined curvature for thermal conductivity curvature { x = Θ[K], y = λc[W/(m K)] }
Declaration
public Polygon2D UserThermalConductivityCurvature { get; set; }
Property Value
 Type |  Description
 Polygon2D
Improve this Doc   View Source
UserThermalExpansionCurvature
User-defined curvature for thermal expansion curvature { x = Θ[K], y = γ[K-1] }
Declaration
public Polygon2D UserThermalExpansionCurvature { get; set; }
Property Value
 Type |  Description
 Polygon2D
Improve this Doc   View Source
UserThermalSpecificHeatCurvature
User-defined curvature for thermal specific heat { x = Θ[K], y = cp[J/(kg K)] }
Declaration
public Polygon2D UserThermalSpecificHeatCurvature { get; set; }
Property Value
 Type |  Description
 Polygon2D
Improve this Doc   View Source
UserThermalStrainCurvature
User-defined curvature for thermal strain curvature { x = Θ[K], y = εc[Δl/l] }
Declaration
public Polygon2D UserThermalStrainCurvature { get; set; }
Property Value
 Type |  Description
 Polygon2D
Improve this Doc   View Source
UserThermalStressStrainCurvature
User-defined curvature for thermal stress,strain { Temperature = Θ[K], {x = ε[-], y = σ[Pa]}}
Declaration
public List<TemperatureCurve2D> UserThermalStressStrainCurvature { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<TemperatureCurve2D>
 Improve this Doc
 View Source